{
  "meta": {
    "project": "StreamSuites Runtime",
    "last_updated": "2026-01-01"
  },
  "entries": [
    {
      "id": "2026-01-alpha-version-sync",
      "date": "2026-01-01",
      "version": "v0.2.2-alpha",
      "scope": "runtime",
      "title": "Alpha metadata corrected",
      "summary": "Captured the v0.2.2-alpha metadata update while preserving historical runtime changelog versions.",
      "details": [
        "Documented the alpha-stage metadata sweep across runtime exports without altering prior release identifiers.",
        "Maintained v0.2.1-alpha labels on December runtime records for audit continuity.",
        "Flagged the metadata refresh as non-runtime-executing to keep static delivery intact."
      ],
      "tags": [
        "alpha",
        "metadata",
        "runtime"
      ],
      "is_latest": true
    },
    {
      "id": "2025-12-project-resumed",
      "date": "2025-12-31",
      "version": "v0.2.2-alpha",
      "scope": "global",
      "title": "Project resumed",
      "summary": "StreamSuites dashboard resumes active monitoring with live runtime snapshots and Rumble marked paused.",
      "details": [
        "Removed suspension banners and reinstated active language across public and admin surfaces.",
        "Dashboard now polls runtime snapshots for platform status, heartbeat timestamps, and paused reasons.",
        "Rumble remains paused with red status indicators while YouTube and Twitch monitoring stay active."
      ],
      "tags": [
        "resumed",
        "dashboard",
        "runtime"
      ],
      "is_latest": false
    },
    {
      "id": "2025-12-project-suspended",
      "date": "2025-12-28",
      "version": "v0.2.2-alpha",
      "scope": "runtime",
      "title": "Runtime suspended",
      "summary": "Historical suspension notice preserved for reference after resumption.",
      "details": [
        "Documented the temporary suspension triggered by unstable Rumble chat ingestion.",
        "Recorded mitigation attempts and export shapes used during the pause.",
        "Superseded by the May 2025 resumption; monitoring now continues with Rumble paused."
      ],
      "tags": [
        "suspended",
        "runtime",
        "notice"
      ],
      "is_latest": false
    },
    {
      "id": "2025-12-runtime-export-refresh",
      "date": "2025-12-18",
      "version": "0.1.x",
      "scope": "runtime",
      "title": "Runtime export refresh",
      "summary": "Runtime changelog now ships as a committed JSON bundle for static delivery.",
      "details": [
        "Pinned runtime changelog exports to a versioned JSON artifact served from GitHub Pages.",
        "Kept dashboard merge logic tolerant of missing runtime payloads while preserving dashboard entries.",
        "Matched scope tagging with dashboard releases so combined views stay consistent."
      ],
      "tags": [
        "runtime",
        "exports",
        "visibility"
      ],
      "is_latest": false
    }
  ]
}
